Revit 2026 API

# IFCData Constructor

---

Creates a copy object.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCData(
	IFCData from
)
```
```vb
Public Sub New (
	from As IFCData
)
```
```cpp
public:
IFCData(
	IFCData^ from
)
```
```fsharp
new :
        from : IFCData -> IFCData
```

#### Parameters

from IFCData
     The IFCData object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace